public class I_Massv_string {
// 1) Создайте массив из всех чётных чисел от 2 до 20 и выведите элементы массива на экран сначала в строку,
// отделяя один элемент от другого пробелом, а затем в столбик
// (отделяя один элемент от другого началом новой строки).
// Перед созданием массива подумайте, какого он будет размера. 2 4 6 … 18 20    2 4 6 … 20

    public static void main(String[] args) {
       int arr1[] = new int[11];
            for (int i=1;i<11;i++){
                  arr1[i]=i*2;
//                  System.out.println("arr1 :"+arr1[i]);
                      System.out.print(" arr1 :"+arr1[i]);

            }
    }
    }
